[
  {
    "input": "hello",
    "response": "Hello! I'm your medical assistant chatbot. How can I help you today? I can provide information about diseases, symptoms, treatments, and health insurance policies.",
    "category": "greeting"
  },
  {
    "input": "hi",
    "response": "Hi there! Welcome to your medical assistant. I'm here to help you with health-related questions, disease information, and insurance policy queries. What would you like to know?",
    "category": "greeting"
  },
  {
    "input": "good morning",
    "response": "Good morning! I'm your medical assistant chatbot. I can help you with information about diseases, symptoms, treatments, and health insurance. How can I assist you today?",
    "category": "greeting"
  },
  {
    "input": "good afternoon",
    "response": "Good afternoon! I'm here to help you with medical information and health insurance queries. What can I help you with today?",
    "category": "greeting"
  },
  {
    "input": "good evening",
    "response": "Good evening! I'm your medical assistant chatbot. I can provide information about diseases, symptoms, treatments, and health insurance policies. How may I help you?",
    "category": "greeting"
  },
  {
    "input": "how are you",
    "response": "I'm functioning well, thank you for asking! I'm here and ready to help you with any medical or health insurance related questions. What would you like to know?",
    "category": "greeting"
  },
  {
    "input": "what can you do",
    "response": "I can help you with:\n• Information about diseases and medical conditions\n• Symptoms and their possible causes\n• Treatment options and medications\n• Health insurance policy information\n• General health advice\n\nJust ask me about any health-related topic!",
    "category": "capability"
  },
  {
    "input": "help",
    "response": "I'm here to help! I can provide information about:\n\n🏥 **Diseases & Conditions**: Ask about specific diseases, symptoms, causes, and treatments\n\n💊 **Medications**: Information about medicines and their uses\n\n🏥 **Health Insurance**: Policy coverage, claims, and insurance-related queries\n\n💡 **General Health**: Tips and advice for maintaining good health\n\nJust type your question and I'll do my best to help!",
    "category": "help"
  },
  {
    "input": "thank you",
    "response": "You're welcome! I'm glad I could help. If you have any other questions about health, diseases, or insurance, feel free to ask. Take care!",
    "category": "gratitude"
  },
  {
    "input": "thanks",
    "response": "You're welcome! I'm here whenever you need help with health-related questions. Stay healthy!",
    "category": "gratitude"
  },
  {
    "input": "bye",
    "response": "Goodbye! Take care of your health and feel free to return if you have more questions. Stay well!",
    "category": "farewell"
  },
  {
    "input": "goodbye",
    "response": "Goodbye! Remember to prioritize your health and wellness. I'm here whenever you need medical information or assistance. Take care!",
    "category": "farewell"
  },
  {
    "input": "see you",
    "response": "See you later! Don't hesitate to come back if you have any health-related questions. Stay healthy!",
    "category": "farewell"
  },
  {
    "input": "who are you",
    "response": "I'm your medical assistant chatbot, designed to help you with health-related information. I can provide details about diseases, symptoms, treatments, medications, and health insurance policies. I'm here to support your health journey!",
    "category": "identity"
  },
  {
    "input": "what is your name",
    "response": "I'm your medical assistant chatbot. You can call me your health assistant or medical bot. I'm here to help you with health-related questions and information!",
    "category": "identity"
  },
  {
    "input": "are you a doctor",
    "response": "No, I'm not a doctor. I'm an AI assistant that can provide general health information from medical databases. For specific medical advice, diagnosis, or treatment, please consult with a qualified healthcare professional. I'm here to help with information, but medical decisions should be made by your doctor.",
    "category": "disclaimer"
  },
  {
    "input": "can you diagnose me",
    "response": "I cannot diagnose medical conditions. I can only provide general information about diseases and symptoms. For proper diagnosis and treatment, please consult with a qualified healthcare professional. I'm here to help with information, but medical decisions should be made by your doctor.",
    "category": "disclaimer"
  },
  {
    "input": "emergency",
    "response": "🚨 **EMERGENCY**: If you're experiencing a medical emergency, please:\n\n• Call emergency services immediately (112 or your local emergency number)\n• Go to the nearest emergency room\n• Contact your doctor or healthcare provider\n\nI cannot provide emergency medical assistance. Your safety is the top priority!",
    "category": "emergency"
  },
  {
    "input": "urgent",
    "response": "🚨 **URGENT MEDICAL ATTENTION NEEDED**:\n\nIf you're experiencing severe symptoms, please:\n• Call emergency services (112)\n• Go to the nearest hospital\n• Contact your doctor immediately\n\nI cannot provide urgent medical care. Please seek professional help right away!",
    "category": "emergency"
  },
  {
    "input": "i'm not feeling well",
    "response": "I'm sorry to hear you're not feeling well. I can help you find information about symptoms and conditions, but for proper diagnosis and treatment, please consult with a healthcare professional. What symptoms are you experiencing? I can provide general information to help you understand what might be going on.",
    "category": "concern"
  },
  {
    "input": "i feel sick",
    "response": "I understand you're feeling sick. I can help you find information about symptoms and conditions, but for proper medical care, please see a doctor. Can you tell me what symptoms you're experiencing? I can provide general information to help you understand your condition better.",
    "category": "concern"
  },
  {
    "input": "what should i do",
    "response": "I can help guide you, but the best course of action depends on your specific situation. If you're experiencing:\n\n• **Severe symptoms**: Seek immediate medical attention\n• **Mild symptoms**: I can provide information, but consider consulting a doctor\n• **General questions**: I'm happy to help with information\n\nWhat specific situation are you dealing with?",
    "category": "guidance"
  },
  {
    "input": "i need help",
    "response": "I'm here to help! I can assist you with:\n\n• Information about diseases and conditions\n• Understanding symptoms\n• Treatment options\n• Health insurance queries\n• General health advice\n\nWhat specific help do you need? Just let me know what you're looking for!",
    "category": "assistance"
  },
  {
    "input": "i have a question",
    "response": "I'm ready to help answer your question! I can provide information about diseases, symptoms, treatments, medications, and health insurance. What would you like to know?",
    "category": "assistance"
  },
  {
    "input": "tell me more",
    "response": "I'd be happy to provide more information! What specific topic would you like to know more about? I can help with:\n\n• Disease details and symptoms\n• Treatment options\n• Medication information\n• Health insurance policies\n• General health tips\n\nJust let me know what interests you!",
    "category": "assistance"
  },
  {
    "input": "i don't understand",
    "response": "I'm here to help clarify things for you! Could you please:\n\n• Tell me what specific information you need\n• Ask your question in a different way\n• Let me know what part is unclear\n\nI want to make sure you get the information you need. What would you like me to explain better?",
    "category": "clarification"
  },
  {
    "input": "can you explain",
    "response": "Of course! I'm here to explain things clearly. What would you like me to explain? I can help with:\n\n• Medical terms and conditions\n• Treatment procedures\n• Insurance policies\n• Health concepts\n\nJust tell me what you need explained!",
    "category": "clarification"
  },
  {
    "input": "i'm confused",
    "response": "I understand confusion can be frustrating. Let me help clarify things for you. Could you please:\n\n• Tell me what specific topic is confusing you\n• Ask your question in a simpler way\n• Let me know what information you're looking for\n\nI'm here to help make things clear for you!",
    "category": "clarification"
  },
  {
    "input": "that's helpful",
    "response": "I'm glad that was helpful! I'm here to provide useful information about health and medical topics. If you have any other questions or need more information, feel free to ask. Is there anything else you'd like to know?",
    "category": "feedback"
  },
  {
    "input": "that's not helpful",
    "response": "I'm sorry that wasn't helpful. Let me try to provide better information. Could you please:\n\n• Tell me what specific information you need\n• Ask your question in a different way\n• Let me know what would be more helpful\n\nI want to make sure you get the information you're looking for!",
    "category": "feedback"
  },
  {
    "input": "i need a doctor",
    "response": "If you need to see a doctor, here are some options:\n\n• **Emergency**: Go to the nearest emergency room or call emergency services\n• **Urgent care**: Visit an urgent care clinic for non-emergency issues\n• **Primary care**: Schedule an appointment with your regular doctor\n• **Specialist**: Ask your primary doctor for a referral to a specialist\n\nI can provide information about conditions, but for diagnosis and treatment, please see a healthcare professional.",
    "category": "referral"
  },
  {
    "input": "where should i go",
    "response": "The best place to go depends on your situation:\n\n• **Emergency symptoms**: Emergency room or call 112\n• **Urgent but not emergency**: Urgent care clinic\n• **Regular check-up**: Your primary care doctor\n• **Specialist care**: Ask your doctor for a referral\n\nWhat symptoms are you experiencing? I can help guide you to the right type of care.",
    "category": "referral"
  },
  {
    "input": "how do i find a doctor",
    "response": "Here are ways to find a doctor:\n\n• **Ask for recommendations** from friends, family, or your current doctor\n• **Check your insurance** provider's directory of in-network doctors\n• **Use online directories** like your local medical board website\n• **Contact your insurance** company for a list of covered providers\n• **Ask at local hospitals** or medical centers\n\nWhat type of doctor do you need? I can help you understand which specialist might be right for your condition.",
    "category": "referral"
  }
] 